<?php
/*---Comments---*/

echo "Это тест"; // Это однострочный комментарий в стиле C++


/* Это многострочный комментарий
   ещё одна строка комментария */
echo "Это ещё один тест";


echo "Последний тест"; # Это комментарий в стиле оболочки Unix

?>

<hr>
<h1>Это <?php # echo "простой";?> пример</h1>
<p>Заголовок вверху выведет 'Это пример'.</p>

<?php
// 'C'-комментарии заканчиваются при первой же обнаруженной последовательности */. Убедитесь, что вы не вкладываете друг в друга 'C'-комментарии. Очень легко допустить эту ошибку при комментировании большого блока кода.
?>
